semestr1/Wstęp do informatyki/wyklad04/wdi wyklad 04.tex
% Created 2022-10-28 Fri 23:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Rafał Grot}
\date{\today}
\title{Wstęp do informatyki Wyklad 04, Złożone typy danych}
\hypersetup{
 pdfauthor={Rafał Grot},
 pdftitle={Wstęp do informatyki Wyklad 04, Złożone typy danych},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Podstawowe typy danych -- przypomnienie (implementacja w C/C++)}
\label{sec:org12b461d}

\begin{center}
\begin{tabular}{l|l|l|l|l}
Słowo kluczowe &  & signed U2 & unsigned NKB & rozmiar\\\empty
\hline
char & \texttt{\_\_int8} & -2\textsuperscript{7} -- -2\textsuperscript{7}-1 & 0 -- 2\textsuperscript{8}-1 & 8b\\\empty
short & \texttt{\_\_int16} & 2\textsuperscript{15} -- -2\textsuperscript{15}-1 &  & 16b\\\empty
int & \texttt{\_\_int32} & \(\vdots\) &  & 32b\\\empty
long & \texttt{\_\_int32} & \(\vdots\) &  & 32b\\\empty
long long int & \texttt{\_\_int64} & 2\textsuperscript{63} -- 2\textsuperscript{63}-1 &  & 64b\\\empty
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{l|l|l}
Słowo kluczowe &  & rozmiar\\\empty
\hline
\texttt{wchar\_t} & UNICODE(0-2\textsuperscript{18}-1) & 16b\\\empty
bool & \texttt{\{0(flase)\}, <>(true)\}} & 8b\\\empty
\end{tabular}
\end{center}
\section{Złożone typy danych}
\label{sec:orgac02e38}
Tych rysunków brakuje ale mnie przerosły.
\subsection{Tablice 1-wymiarowe (wektory), 1-diminsional tables}
\label{sec:org7e88ace}
\subsubsection{Implementation in \texttt{C/C++} language}
\label{sec:orgf8d27db}
\begin{verbatim}
int A[10];
int* B = new int[10]; //C+=
int* C = (int*)malloc(10* sizeof(int)); //C
\end{verbatim}
\textbf{obrazki}

\hline
\begin{verbatim}
int* A = new int[10];
char* B = (char*)A;
\end{verbatim}
\textbf{obrazki}
\begin{verbatim}
string(B, "Ala ma kota");
\end{verbatim}

\hline

\begin{verbatim}
void foo(char a);

char b=0;
foo(b);
\end{verbatim}

\hline

\begin{verbatim}
void foo(char a[10]);

char b[0] = {Ab}; //to niby jest string
foo(b);
\end{verbatim}
\hline

\begin{verbatim}
void foo(char a[]);
foo(char* a);
char* c=b;
foo(c);
\end{verbatim}

\hline
\begin{verbatim}
void foo(const char* a);
\end{verbatim}

\newpage
\hline
\begin{verbatim}
int count(const char* a, char b)
{
  int n=0;
  while(*a){
    if(*a==b)++n;
    ++a;
    }
  return n;

  char A="Ala ma kota";
  int n=count(A, 'k');
  int n2=count(A, 'n');
}
\end{verbatim}
\hline
\begin{verbatim}
int n = 0;
do { if (*a==b) ++n; } while(*a++);
return n;
\end{verbatim}
\hline
\begin{verbatim}
int sum(const int a*)
int A[10];
int S = Sum(A);
\end{verbatim}
\begin{verbatim}
N nieudanych prób studentów. (N=3)
\end{verbatim}


\hline
\begin{verbatim}
int Sum(int N, const int *A)
{
  int S = 0;
  while(N--) S+=*A++;
  return S;
}
\end{verbatim}
\end{document}